project-chip/connectedhomeip/examples/platform/silabs/efr32/wf200/host_if.cpp
    return SL_STATUS_OK;
}

#ifdef SL_WFX_CONFIG_SCAN
/****************************************************************************
 * @fn   static void sl_wfx_scan_result_callback(sl_wfx_scan_result_ind_body_t *scan_result)
 * @brief
 * Callback for individual scan result
 * @param[in] scan_result:
 * @return None
 *****************************************************************************/
static void sl_wfx_scan_result_callback(sl_wfx_scan_result_ind_body_t * scan_result)
{
    struct scan_result_holder * ap;

    SILABS_LOG("# %2d %2d  %03d %02X:%02X:%02X:%02X:%02X:%02X  %s", scan_count, scan_result->channel,
              ((int16_t)(scan_result->rcpi - 220) / 2), scan_result->mac[0], scan_result->mac[1], scan_result->mac[2],
              scan_result->mac[3], scan_result->mac[4], scan_result->mac[5], scan_result->ssid_def.ssid);
    /*Report one AP information*/
    SILABS_LOG("\r\n");
    /* don't save if filter only wants specific ssid */
    if (scan_ssid != (char *) 0)
    {
        if (strcmp(scan_ssid, (char *) &scan_result->ssid_def.ssid[0]) != CMP_SUCCESS)
            return;
    }
    if ((ap = (struct scan_result_holder *) pvPortMalloc(sizeof(*ap))) == (struct scan_result_holder *) 0)
    {
        SILABS_LOG("*ERR*Scan: No Mem");
    }
    else
    {
        ap->next  = scan_save;
        scan_save = ap;
        /* Not checking if scan_result->ssid_length is < 33 */
        memcpy(ap->scan.ssid, scan_result->ssid_def.ssid, scan_result->ssid_def.ssid_length);
        ap->scan.ssid[scan_result->ssid_def.ssid_length] = 0; /* make sure about null terminate */
        /* We do it in this order WPA3 first */
        /* No EAP supported - Is this required */
        if (scan_result->security_mode.wpa3)
        {
            ap->scan.security = WFX_SEC_WPA3;
        }
        else if (scan_result->security_mode.wpa2)
        {
            ap->scan.security = WFX_SEC_WPA2;
        }
        else if (scan_result->security_mode.wpa)
        {
            ap->scan.security = WFX_SEC_WPA;
        }
        else if (scan_result->security_mode.wep)
        {
            ap->scan.security = WFX_SEC_WEP;
        }
        else
        {
            ap->scan.security = WFX_SEC_NONE;
        }
        ap->scan.chan = scan_result->channel;
        ap->scan.rssi = scan_result->rcpi;
        memcpy(&ap->scan.bssid[0], &scan_result->mac[0], BSSID_MAX_STR_LEN);
        scan_count++;
    }
}

/****************************************************************************
 * @fn   static void sl_wfx_scan_complete_callback(uint32_t status)
 * @brief
 * Callback for scan complete
 * @param[in] status:
 * @return None
 *****************************************************************************/
/* ARGSUSED */
static void sl_wfx_scan_complete_callback(uint32_t status)
{
    (void) (status);
    /* Use scan_count value and reset it */
    xEventGroupSetBits(sl_wfx_event_group, SL_WFX_SCAN_COMPLETE);
}
#endif /* SL_WFX_CONFIG_SCAN */

/****************************************************************************
 * @fn  static void sl_wfx_connect_callback(uint8_t *mac, uint32_t status)
 * @brief
 * Callback when station connects
 * @param[in]  mac:
 * @param[in]  status:
 * @return None
 *****************************************************************************/
static void sl_wfx_connect_callback(uint8_t * mac, uint32_t status)
{
    (void) (mac);
    switch (status)
    {
    case WFM_STATUS_SUCCESS: {
        SILABS_LOG("STA-Connected\r\n");
        memcpy(&ap_mac.octet[0], mac, MAC_ADDRESS_FIRST_OCTET);
        sl_wfx_context->state =
            static_cast<sl_wfx_state_t>(static_cast<int>(sl_wfx_context->state) | static_cast<int>(SL_WFX_STA_INTERFACE_CONNECTED));
        xEventGroupSetBits(sl_wfx_event_group, SL_WFX_CONNECT);
        break;
    }
    case WFM_STATUS_NO_MATCHING_AP: {
        SILABS_LOG("WFX Connection failed, access point not found\r\n");
        break;
    }
    case WFM_STATUS_CONNECTION_ABORTED: {
        SILABS_LOG("WFX Connection aborted\r\n");
        break;
    }
    case WFM_STATUS_CONNECTION_TIMEOUT: {
        SILABS_LOG("WFX Connection timeout\r\n");
        break;
    }
    case WFM_STATUS_CONNECTION_REJECTED_BY_AP: {
        SILABS_LOG("WFX Connection rejected by the access point\r\n");
        break;
    }
    case WFM_STATUS_CONNECTION_AUTH_FAILURE: {
        SILABS_LOG("WFX Connection authentication failure\r\n");
        break;
    }
    default: {
        SILABS_LOG("WF Connection attempt error\r\n");
    }
    }

    if ((status != WFM_STATUS_SUCCESS) && retryJoin < MAX_JOIN_RETRIES_COUNT)
    {
        retryJoin += 1;
        retryInProgress = false;
        SILABS_LOG("WFX Retry to connect to network count: %d", retryJoin);
        sl_wfx_context->state =
            static_cast<sl_wfx_state_t>(static_cast<int>(sl_wfx_context->state) & ~static_cast<int>(SL_WFX_STARTED));
        xEventGroupSetBits(sl_wfx_event_group, SL_WFX_RETRY_CONNECT);
    }
}

/****************************************************************************
 * @fn   static void sl_wfx_disconnect_callback(uint8_t *mac, uint16_t reason)
 * @brief
 * Callback for station disconnect
 * @param[in]  mac:
 * @param[in]  reason:
 * @return None
 *****************************************************************************/
static void sl_wfx_disconnect_callback(uint8_t * mac, uint16_t reason)
{
    (void) (mac);
    SILABS_LOG("WFX Disconnected %d\r\n", reason);
    sl_wfx_context->state =
        static_cast<sl_wfx_state_t>(static_cast<int>(sl_wfx_context->state) & ~static_cast<int>(SL_WFX_STA_INTERFACE_CONNECTED));
    xEventGroupSetBits(sl_wfx_event_group, SL_WFX_DISCONNECT);
}

#ifdef SL_WFX_CONFIG_SOFTAP
/****************************************************************************
 * @fn  static void sl_wfx_start_ap_callback(uint32_t status)
 * @brief
 * Callback for AP started
 * @param[in]  status:
 * @return None
 *****************************************************************************/
static void sl_wfx_start_ap_callback(uint32_t status)
{
    if (status == AP_START_SUCCESS)
    {
        SILABS_LOG("AP started\r\n");
        sl_wfx_context->state =
            static_cast<sl_wfx_state_t>(static_cast<int>(sl_wfx_context->state) | static_cast<int>(SL_WFX_AP_INTERFACE_UP));
        xEventGroupSetBits(sl_wfx_event_group, SL_WFX_START_AP);
    }
    else
    {
        SILABS_LOG("AP start failed\r\n");
        strcpy(event_log, "AP start failed");
    }
}

/****************************************************************************
 * @fn   static void sl_wfx_stop_ap_callback(void)
 * @brief
 * Callback for AP stopped
 * @param[in]  None
 * @return None
 *****************************************************************************/
static void sl_wfx_stop_ap_callback(void)
{
    // TODO
    // dhcpserver_clear_stored_mac();
    SILABS_LOG("SoftAP stopped\r\n");
    sl_wfx_context->state =
        static_cast<sl_wfx_state_t>(static_cast<int>(sl_wfx_context->state) & ~static_cast<int>(SL_WFX_AP_INTERFACE_UP));
    xEventGroupSetBits(sl_wfx_event_group, SL_WFX_STOP_AP);
}

/****************************************************************************
 * @fn  static void sl_wfx_client_connected_callback(uint8_t *mac)
 * @brief
 * Callback for client connect to AP
 * @param[in]  mac:
 * @return None
 *****************************************************************************/
static void sl_wfx_client_connected_callback(uint8_t * mac)
{
    SILABS_LOG("Client connected, MAC: %02X:%02X:%02X:%02X:%02X:%02X\r\n", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    // TODO
    SILABS_LOG("Open a web browser and go to http://%d.%d.%d.%d\r\n", ap_ip_addr0, ap_ip_addr1, ap_ip_addr2, ap_ip_addr3);
}

/****************************************************************************
 * @fn  static void sl_wfx_ap_client_rejected_callback(uint32_t status, uint8_t *mac)
 * @brief
 * Callback for client rejected from AP
 * @param[in] status:
 * @param[in] mac:
 * @return None
 *****************************************************************************/
static void sl_wfx_ap_client_rejected_callback(uint32_t status, uint8_t * mac)
{
    {
        // TODO
        SILABS_LOG("Client rejected, reason: %d, MAC: %02X:%02X:%02X:%02X:%02X:%02X\r\n", (int) status, mac[0], mac[1], mac[2],
                  mac[3], mac[4], mac[5]);
    }

    /****************************************************************************
     * @fn  static void sl_wfx_ap_client_disconnected_callback(uint32_t status, uint8_t *mac)
     * @brief
     * Callback for AP client disconnect
     * @param[in] status:
     * @param[in]  mac:
     * @return  None
     *****************************************************************************/
    static void sl_wfx_ap_client_disconnected_callback(uint32_t status, uint8_t * mac)
    {
        // TODO
        SILABS_LOG("Client disconnected, reason: %d, MAC: %02X:%02X:%02X:%02X:%02X:%02X\r\n", (int) status, mac[0], mac[1], mac[2],
                  mac[3], mac[4], mac[5]);
    }
#endif /* SL_WFX_CONFIG_SOFTAP */

    /****************************************************************************
     * @fn   static void sl_wfx_generic_status_callback(sl_wfx_generic_ind_t *frame)
     * @brief
     * Callback for generic status received
     * @param[in] farme:
     * @return None
     *****************************************************************************/
    static void sl_wfx_generic_status_callback(sl_wfx_generic_ind_t * frame)
    {
        (void) (frame);
        SILABS_LOG("WFX Generic status received\r\n");
    }

    /***************************************************************************
     * @fn  static void wfx_events_task(void *p_arg)
     * @brief
     * WFX events processing task.
     * @param[in] p_arg:
     * @return None
     ******************************************************************************/
    static void wfx_events_task(void * p_arg)
    {
        TickType_t last_dhcp_poll, now;
        EventBits_t flags;
        (void) p_arg;

        sta_netif      = wfx_get_netif(SL_WFX_STA_INTERFACE);
        last_dhcp_poll = xTaskGetTickCount();
        while (true)
        {
            flags = xEventGroupWaitBits(sl_wfx_event_group,
                                        SL_WFX_CONNECT | SL_WFX_DISCONNECT
#ifdef SL_WFX_CONFIG_SOFTAP
                                            | SL_WFX_START_AP | SL_WFX_STOP_AP
#endif /* SL_WFX_CONFIG_SOFTAP */
#ifdef SL_WFX_CONFIG_SCAN
                                            | SL_WFX_SCAN_START | SL_WFX_SCAN_COMPLETE
#endif /* SL_WFX_CONFIG_SCAN */
                                            | BITS_TO_WAIT,
                                        pdTRUE, pdFALSE, pdMS_TO_TICKS(250)); /* 250 msec delay converted to ticks */
            if (flags & SL_WFX_RETRY_CONNECT)
            {
                if (!retryInProgress)
                {
                    SILABS_LOG("WFX sending the connect command");
                    wfx_connect_to_ap();
                    retryInProgress = true;
                }
            }

            if (wifi_extra & WE_ST_STA_CONN)
            {
                if ((now = xTaskGetTickCount()) > (last_dhcp_poll + pdMS_TO_TICKS(250)))
                {
#if (CHIP_DEVICE_CONFIG_ENABLE_IPV4)
                    uint8_t dhcp_state = dhcpclient_poll(&sta_netif);

                    if ((dhcp_state == DHCP_ADDRESS_ASSIGNED) && !hasNotifiedIPV4)
                    {
                        wfx_dhcp_got_ipv4((uint32_t) sta_netif->ip_addr.u_addr.ip4.addr);
                        hasNotifiedIPV4 = true;
                        if (!hasNotifiedWifiConnectivity)
                        {
                            SILABS_LOG("WIFI: Has Notified Wifi Connectivity");
                            wfx_connected_notify(CONNECTION_STATUS_SUCCESS, &ap_mac);
                            hasNotifiedWifiConnectivity = true;
                        }
                    }
                    else if (dhcp_state == DHCP_OFF)
                    {
                        wfx_ip_changed_notify(IP_STATUS_FAIL);
                        hasNotifiedIPV4 = false;
                    }
#endif // CHIP_DEVICE_CONFIG_ENABLE_IPV4
                    if ((ip6_addr_ispreferred(netif_ip6_addr_state(sta_netif, 0))) && !hasNotifiedIPV6)
                    {
                        wfx_ipv6_notify(GET_IPV6_SUCCESS);
                        hasNotifiedIPV6 = true;
                        if (!hasNotifiedWifiConnectivity)
                        {
                            wfx_connected_notify(CONNECTION_STATUS_SUCCESS, &ap_mac);
                            hasNotifiedWifiConnectivity = true;
                        }
                    }
                    last_dhcp_poll = now;
                }
            }

