project-chip/connectedhomeip/examples/platform/silabs/efr32/wf200/host_if.cpp
        sl_wfx_host_gpio_init();
        if ((status = wfx_init()) == SL_STATUS_OK)
        {
            /* Initialize the LwIP stack */
            SILABS_LOG("WF200:Start LWIP");
            wfx_lwip_start();
            wifiContext.state = SL_WFX_STARTED; /* Really this is a bit mask */
            SILABS_LOG("WF200:ready..");
        }
        else
        {
            SILABS_LOG("*ERR*WF200:init failed");
        }
    }

    /************************************************************************
     * @fn   int32_t wfx_get_ap_info(wfx_wifi_scan_result_t *ap)
     * @brief
     * Get AP info
     * @param[in]  ap: access point
     * @return returns -1
     **************************************************************************/
    int32_t wfx_get_ap_info(wfx_wifi_scan_result_t * ap)
    {
        /* TODO */
        return -1;
    }

    /************************************************************************
     * @fn   int32_t wfx_get_ap_ext(wfx_wifi_scan_ext_t *extra_info)
     * @brief
     * Get AP extra info
     * @param[in]  extra_info: access point extra information
     * @return returns -1
     **************************************************************************/
    int32_t wfx_get_ap_ext(wfx_wifi_scan_ext_t * extra_info)
    {
        /* TODO */
        return -1;
    }

    /************************************************************************
     * @fn    int32_t wfx_reset_counts()
     * @brief
     *    reset the count
     * @param[in]  None
     * @return returns -1
     **************************************************************************/
    int32_t wfx_reset_counts()
    {
        /* TODO */
        return -1;
    }

    /*************************************************************************
     * @fn   sl_status_t wfx_wifi_start(void)
     * @brief
     * I think that this is getting called before FreeRTOS threads are ready
     * @param[in] none
     * @return  returns SL_STATUS_OK
     **************************************************************************/
    sl_status_t wfx_wifi_start(void)
    {
        if (wifi_extra & WE_ST_STARTED)
        {
            SILABS_LOG("WIFI: Already started");
            return SL_STATUS_OK;
        }
        wifi_extra |= WE_ST_STARTED;
        wfx_soft_init();
        wfx_wifi_hw_start();

        return SL_STATUS_OK;
    }

    /****************************************************************************
     * @fn sl_wfx_state_t wfx_get_wifi_state(void)
     * @brief
     *      get the wifi state
     * @param[in]  None
     * @return returns wificonetext state
     *****************************************************************************/
    sl_wfx_state_t wfx_get_wifi_state(void) { return wifiContext.state; }

    /****************************************************************************
     * @fn  struct netif *wfx_GetNetif(sl_wfx_interface_t interface)
     * @brief
     *      getnetif using interface
     * @param[in]  interface:
     * @return returns selectedNetif
     *****************************************************************************/
    struct netif * wfx_GetNetif(sl_wfx_interface_t interface)
    {
        struct netif * SelectedNetif = NULL;
        if (interface == SL_WFX_STA_INTERFACE)
        {
            SelectedNetif = sta_netif;
        }
#ifdef SL_WFX_CONFIG_SOFTAP
        else if (interface == SL_WFX_SOFTAP_INTERFACE)
        {
            // no ap currently
        }
#endif
        return SelectedNetif;
    }

    /****************************************************************************
     * @fn  sl_wfx_mac_address_t wfx_get_wifi_mac_addr(sl_wfx_interface_t interface)
     * @brief
     * get the wifi mac address using interface
     * @param[in] interface:
     * @return  returns wificontext.mac_addr_o if successful,
     *          wificontext.mac_addr_1 otherwise
     *****************************************************************************/
    sl_wfx_mac_address_t wfx_get_wifi_mac_addr(sl_wfx_interface_t interface)
    {
        // return Mac address used by WFX SL_WFX_STA_INTERFACE or SL_WFX_SOFTAP_INTERFACE,
        return (interface == SL_WFX_STA_INTERFACE) ? wifiContext.mac_addr_0 : wifiContext.mac_addr_1;
    }

    /****************************************************************************
     * @fn  void wfx_set_wifi_provision(wfx_wifi_provision_t *wifiConfig)
     * @brief
     * set the wifi provision
     * @param[in] wifiConfig: configuration of wifi
     * @return None
     *****************************************************************************/
    void wfx_set_wifi_provision(wfx_wifi_provision_t * wifiConfig)
    {
        memcpy(wifi_provision.ssid, wifiConfig->ssid, sizeof(wifiConfig->ssid));
        memcpy(wifi_provision.passkey, wifiConfig->passkey, sizeof(wifiConfig->passkey));
        SILABS_LOG("WIFI: Provision SSID=%s", &wifi_provision.ssid[0]);

        /* Not very good - To be improved */
        switch (wifiConfig->security)
        {
        case WFX_SEC_WPA:
            wifi_provision.security = static_cast<uint8_t>(sl_wfx_security_mode_e::WFM_SECURITY_MODE_WPA2_WPA1_PSK);
            break;
        case WFX_SEC_WPA3:
            wifi_provision.security = WFM_SECURITY_MODE_WPA3_SAE;
            break;
        case WFX_SEC_WPA2:
            wifi_provision.security = static_cast<uint8_t>(sl_wfx_security_mode_e::WFM_SECURITY_MODE_WPA2_WPA1_PSK);
            break;
        case WFX_SEC_WPA_WPA2_MIXED:
            wifi_provision.security = static_cast<uint8_t>(sl_wfx_security_mode_e::WFM_SECURITY_MODE_WPA2_WPA1_PSK);
            break;
        default:
            wifi_provision.security = WFM_SECURITY_MODE_WPA2_PSK;
            break;
        }
    }

    /****************************************************************************
     * @fn bool wfx_get_wifi_provision(wfx_wifi_provision_t *wifiConfig)
     * @brief
     * get the wifi provision
     * @param[in] wifiConfig: configuration of wifi
     * @return returns true if successful,
     *         false otherwise
     *****************************************************************************/
    bool wfx_get_wifi_provision(wfx_wifi_provision_t * wifiConfig)
    {
        if (wifiConfig == NULL)
        {
            return false;
        }
        memcpy(wifiConfig, &wifi_provision, sizeof(wfx_wifi_provision_t));

