project-chip/connectedhomeip/examples/platform/silabs/efr32/wf200/host_if.cpp
        return true;
    }

    /****************************************************************************
     * @fn  void wfx_clear_wifi_provision(void)
     * @brief
     * clear the wifi provision
     * @param[in] None
     * @return returns true if successful,
     *         false otherwise
     *****************************************************************************/
    void wfx_clear_wifi_provision(void) { memset(&wifi_provision, 0, sizeof(wifi_provision)); }

    /****************************************************************************
     * @fn  bool wfx_is_sta_provisioned(void)
     * @brief
     *      driver STA provisioned
     * @param[in] None
     * @return returns true if successful,
     *         false otherwise
     *****************************************************************************/
    bool wfx_is_sta_provisioned(void) { return (wifi_provision.ssid[0]) ? true : false; }

    /****************************************************************************
     * @fn  sl_status_t wfx_connect_to_ap(void)
     * @brief
     *  driver connect to ap
     * @param[in] None
     * @return returns SL_STATUS_NOT_AVAILABLE
     *****************************************************************************/
    sl_status_t wfx_connect_to_ap(void)
    {
        sl_status_t result;

        if (wifi_provision.ssid[0] == 0)
        {
            return SL_STATUS_NOT_AVAILABLE;
        }
        SILABS_LOG("WIFI:JOIN to %s", &wifi_provision.ssid[0]);

        SILABS_LOG("WIFI Scan Paramter set to Active channel time %d, Passive Channel "
                  "Time: %d, Number of prob: %d",
                  ACTIVE_CHANNEL_TIME, PASSIVE_CHANNEL_TIME, NUM_PROBE_REQUEST);
        (void) sl_wfx_set_scan_parameters(ACTIVE_CHANNEL_TIME, PASSIVE_CHANNEL_TIME, NUM_PROBE_REQUEST);
        result = sl_wfx_send_join_command((uint8_t *) wifi_provision.ssid, strlen(wifi_provision.ssid), NULL, CHANNEL_0,
                                          static_cast<sl_wfx_security_mode_t>(wifi_provision.security), PREVENT_ROAMING,
                                          DISABLE_PMF_MODE, (uint8_t *) wifi_provision.passkey, strlen(wifi_provision.passkey),
                                          NULL, IE_DATA_LENGTH);

        return result;
    }

    /****************************************************************************
     * @fn  void wfx_get_wifi_mac_addr(sl_wfx_interface_t interface, sl_wfx_mac_address_t *addr)
     * @brief
     * get the wifi mac addresss
     * @param[in] interface:
     * @param[in] addr : address
     * @return None
     *****************************************************************************/
    void wfx_get_wifi_mac_addr(sl_wfx_interface_t interface, sl_wfx_mac_address_t * addr)
    {
        sl_wfx_mac_address_t * mac;

#ifdef SL_WFX_CONFIG_SOFTAP
        mac = (interface == SL_WFX_SOFTAP_INTERFACE) ? &wifiContext.mac_addr_1 : &wifiContext.mac_addr_0;
#else
    mac = &wifiContext.mac_addr_0;
#endif
        *addr = *mac;
        SILABS_LOG("WLAN:Get WiFi Mac addr %02x:%02x:%02x:%02x:%02x:%02x", mac->octet[0], mac->octet[1], mac->octet[2],
                  mac->octet[3], mac->octet[4], mac->octet[5]);
    }

    /****************************************************************************
     * @fn  bool wfx_have_ipv4_addr(sl_wfx_interface_t which_if)
     * @brief
     *     function called when driver have ipv4 address
     * @param[in]  which_if:
     * @return returns false if sucessful,
     *         true otherwise
     *****************************************************************************/
    bool wfx_have_ipv4_addr(sl_wfx_interface_t which_if)
    {
        if (which_if == SL_WFX_STA_INTERFACE)
        {
            return (sta_ip == STA_IP_FAIL) ? false : true;
        }
        else
        {
            return false; /* TODO */
        }
    }

    /****************************************************************************
     * @fn  bool wfx_have_ipv6_addr(sl_wfx_interface_t which_if)
     * @brief
     *     function called when driver have ipv6 address
     * @param[in]  which_if:
     * @return returns false if sucessful,
     *         true otherwise
     *****************************************************************************/
    bool wfx_have_ipv6_addr(sl_wfx_interface_t which_if)
    {
        SILABS_LOG("%s: started.", __func__);
        bool status = false;
        if (which_if == SL_WFX_STA_INTERFACE)
        {
            status = wfx_is_sta_connected();
        }
        else
        {
            status = false; /* TODO */
        }
        SILABS_LOG("%s: status: %d", __func__, status);
        return status;
    }

    /****************************************************************************
     * @fn   sl_status_t wfx_sta_discon(void)
     * @brief
     * Disconnect station mode from connected AP
     * @param[in]  None
     * @returns Returns SL_STATUS_OK if successful,
     *             SL_STATUS_FAIL otherwise
     *****************************************************************************/
    sl_status_t wfx_sta_discon(void)
    {
        SILABS_LOG("STA-Disconnecting");
        int32_t status = sl_wfx_send_disconnect_command();
        wifi_extra &= ~WE_ST_STA_CONN;
        xEventGroupSetBits(sl_wfx_event_group, SL_WFX_RETRY_CONNECT);
        return status;
    }

    /****************************************************************************
     * @fn  bool wfx_is_sta_mode_enabled(void)
     * @brief
     *     enable the STA mode
     * @param[in]  None
     * @return returns true
     *****************************************************************************/
    bool wfx_is_sta_mode_enabled(void) { return true; /* It always is */ }

    /****************************************************************************
     * @fn  bool wfx_is_sta_connected(void)
     * @brief
     *     fuction called when driver is STA connected
     * @param[in]  None
     * @return returns true if sucessful,
     *         false otherwise
     *****************************************************************************/
    bool wfx_is_sta_connected(void)
    {
        bool val;

        val = (wifi_extra & WE_ST_STA_CONN) ? true : false;

        SILABS_LOG("WLAN: STA %s connected", (val ? "IS" : "NOT"));

        return val;
    }

    /****************************************************************************
     * @fn  void wfx_setup_ip6_link_local(sl_wfx_interface_t whichif)
     * @brief
     *      It is automatically done when lwip link up
     * @param[in]  None
     * @return returns true if sucessful,
     *         false otherwise
     *****************************************************************************/
    void wfx_setup_ip6_link_local(sl_wfx_interface_t whichif)
    {
        SILABS_LOG("Setup-IP6: TODO"); /* It is automatically done when lwip link up */
    }

    /****************************************************************************
     * @fn  wifi_mode_t wfx_get_wifi_mode()
     * @brief
     *      get the wifi mode
     * @param[in]  None
     * @return returns WIFI_MODE_NULL if sucessful,
     *         WIFI_MODE_STA otherwise
     *****************************************************************************/
    wifi_mode_t wfx_get_wifi_mode()
    {
        if (wifiContext.state & SL_WFX_STARTED)
            return WIFI_MODE_STA;
        return WIFI_MODE_NULL;
    }

    /*****************************************************************************
     * @fn  bool wfx_hw_ready(void)
     * @brief
     * This is called from the context of AppTask
     * For WF200 - Start WIFI here
     * @param[in]  None
     * @return returns true if sucessful,
     *         false otherwise
     ******************************************************************************/
    bool wfx_hw_ready(void) { return (wifiContext.state & SL_WFX_STARTED) ? true : false; }

#if CHIP_DEVICE_CONFIG_ENABLE_IPV4
    /*****************************************************************************
     * @fn  void wfx_dhcp_got_ipv4(uint32_t ip)
     * @brief
     *    function called when dhcp got ipv4
     * @param[in]  ip : internet protocol
     *@return  None
     ******************************************************************************/
    void wfx_dhcp_got_ipv4(uint32_t ip)
    {
        /* Acquire the new IP address
         */
        sta_ip = ip;
        wfx_ip_changed_notify(IP_STATUS_SUCCESS);
    }
#endif /* CHIP_DEVICE_CONFIG_ENABLE_IPV4 */

    /*****************************************************************************
     * @fn  wfx_enable_sta_mode(void)
     * @brief
     *    function called from connectivityManager
     * @param[in]
     * @return  None
     ******************************************************************************/
    void wfx_enable_sta_mode(void)
    {
        /* Nothing to do - default is that it is
           place holder */
    }

/****************************************************************************
 * @fn bool wfx_start_scan(char *ssid, void (*callback)(wfx_wifi_scan_result_t *))
 * @brief
 * driver scan start
 * @param[in]  callback:
 * @return returns true if sucessful,
 *         false otherwise
 *****************************************************************************/
#ifdef SL_WFX_CONFIG_SCAN
    bool wfx_start_scan(char * ssid, void (*callback)(wfx_wifi_scan_result_t *))
    {
        int sz;

        if (scan_cb)
            return false; /* Already in progress */
        if (ssid)
        {
            sz = strlen(ssid);
            if ((scan_ssid = (char *) pvPortMalloc(sz + 1)) == (char *) 0)
            {
                return false;
            }
            strcpy(scan_ssid, ssid);
        }
        scan_cb = callback;
        xEventGroupSetBits(sl_wfx_event_group, SL_WFX_SCAN_START);

        return true;
    }

    /****************************************************************************
     * @fn  void wfx_cancel_scan(void)
     * @brief
     * driver scan cancelation
     * @param[in]  None
     * @return None
     *****************************************************************************/
    void wfx_cancel_scan(void)
    {
        struct scan_result_holder *hp, *next;
        /* Not possible */
        if (!scan_cb)
        {
            return;
        }
        sl_wfx_send_stop_scan_command();
        for (hp = scan_save; hp; hp = next)
        {
            next = hp->next;
            vPortFree(hp);
        }
        scan_save  = (struct scan_result_holder *) 0;
        scan_count = 0;
        if (scan_ssid)
        {
            vPortFree(scan_ssid);
            scan_ssid = (char *) 0;
        }
        scan_cb = 0;
    }
#endif /* SL_WFX_CONFIG_SCAN */
